[
{"link": "https://www.br.freelancer.com/projects/python/integra-scrapeops-com-playwright-python", "title": "Integração ScrapeOPS com Playwright Python", "status": "Aberto", "price": "$30-250 USD", "paid_when": "Pago na entrega", "posted_when": "Postado 4 dias atrás", "deadline": "Termina em 5 dias", "description": ["Preciso melhorar o processo de scraping no meu projeto atual. Para isso, busco um profissional que possa me ajudar a integrar o ScrapeOPS com o framework Playwright em Python, com o foco principal na melhora de eficiência deste processo.", "", "O principal desafio deste projeto será implementar mecanismos que permitam alterar o IP do bot para possibilitar mais requisições. Isso exigirá o uso de proxies para mascarar o IP do bot, o uso de uma VPN para alterar o IP do bot, ou talvez até mesmo a configuração de uma rotação de IPs a cada requisição.", "", "Algumas habilidades e experiências que seriam úteis para este projeto incluem:", "", "- Experiência com Python, particularmente o uso do framework Playwright;", "- Familiaridade com técnicas avançadas de scraping e com a API do ScrapeOPS;", "- Bom entendimento de como proxies e VPNs funcionam e como configurar a rotação de IPs;", "- Embora a maior parte do scraping já esteja desenvolvida, a capacidade de resolver problemas complexos relacionados a essa área seria uma grande vantagem.", "", "Em resumo, preciso apenas da integração com a rotação de proxies e as demais configurações para alteração do IP. Todo o resto já está desenvolvido, portanto, este será o foco principal do trabalho. Observação: possuo um código exemplo para disponibilizar aos interessados nesse projeto. Estou em busca de uma entrega rápida e funcional.", ""]},
{"link": "https://www.br.freelancer.com/projects/hadoop-sales/google-cloud-training-for-big", "title": "Google Cloud Training for Big Data", "status": "Aberto", "price": "€8-30 EUR", "paid_when": "Pago na entrega", "posted_when": "Postado 3 horas atrás", "deadline": "Termina em 6 dias", "description": ["As a beginner, I am seeking a knowledgeable developer who can guide me on effectively using Google Cloud for Hadoop, Spark, Hive, pig, and MR. The main goal is data processing and analysis.", "", "Key Knowledge Areas Needed:", "- Google Cloud usage for big data management", "- Relevant functionalities of Hadoop, Spark, Hive, pig, and MR", "- Best practices for data storage, retrieval, and workflow streamlining", "", "Ideal Skills:", "- Extensive Google Cloud experience", "- Proficiency in Hadoop, Spark, Hive, Pig, and MR for data processes", "- Strong teaching abilities for beginners", "- Demonstrated experience in data processing and analysis.", ""]},
{"link": "https://www.br.freelancer.com/projects/c-programming/raspberrypi-iot-automation-coding", "title": "RaspberryPi IoT Automation Coding", "status": "Aberto", "price": "₹150000-250000 INR", "paid_when": "Pago na entrega", "posted_when": "Postado 3 horas atrás", "deadline": "Termina em 6 dias", "description": ["I'm seeking a seasoned IoT developer proficient in RaspberryPi software who can swiftly design a system that provides device control and automation.", "", "Key responsibilities would include:", "", "- Creating a script that can efficiently control and automate multiple devices.", "- Ensuring the seamless integration of the coded script with my current system.", "- Correctly installing and testing the software on RaspberryPi devices.", "", "Due to the urgency of this project, it's crucial for the freelancer to be able to engineer a solution ASAP. The successful bidder will have extensive experience in Internet of Things coding and a strong track record deploying automation and device control solutions on the RaspberryPi platform.", ""]},
{"link": "https://www.br.freelancer.com/projects/machine-learning/cutting-edge-decision-making-platform", "title": "Cutting-Edge AI Decision-Making Platform", "status": "Aberto", "price": "₹12500-37500 INR", "paid_when": "Pago na entrega", "posted_when": "Postado 2 horas atrás", "deadline": "Termina em 6 dias", "description": ["I’m seeking to develop an AI-based platform with the primary goal of improving decision-making. The system should facilitate superior user experiences for my customers with some distinct functions:", "", "1. Natural Language Processing (NLP): The platform should effectively understand, interpret, and generate human language. It should be capable of seamless text analysis, sentiment analysis, and language translation.", "", "2. Machine Learning Algorithms: Implement robust machine learning algorithms to accurately predict outcomes, trends, and behaviors. These algorithms should iteratively learn from the data and autonomously adapt to produce reliable and thoughtful decisions.", "", "3. Intelligent Data Analysis: I need the platform to intelligently analyze data to identify patterns, trends, or structures. Through this, it should inform strategic decision-making and provide actionable insights.", "", "A freelancer with a strong background in Artificial Intelligence, Machine Learning, NLP, and data analysis would be perfect for this project. Prior experience dealing with AI platforms focusing particularly on enhancing customer experiences or decision-making processes would be a definite advantage. Your ability to deliver a user-friendly interface designed specifically for customer interactions is also essential.", ""]},
{"link": "https://www.br.freelancer.com/projects/machine-learning/nueral-network-for-emotion", "title": "Nueral Network for Emotion Classification", "status": "Aberto", "price": "$30-250 USD", "paid_when": "Pago na entrega", "posted_when": "Postado 2 horas atrás", "deadline": "Termina em 6 dias", "description": ["I'm seeking a freelancer experienced in building machine learning models. Data is parsed and stored in arrays format as follow:", "", "1) Audio features using librosa", "2) Spectrogram images", "", "The task entitles creating 8 models as follow:", "1) two different audio classification models", "2) two different image classification models", "3) 1 ensmeble model from the two audio models", "4) 1 ensmeble model from the image models", "5) 2 multimodals (early fusuon and late fusion) from audio and image modities", "", "Data is imbalanced, 6 emotions", "", "Reach out to me ONLY if you have strong experience in building audio and image classification models.", "", "You will build/fine tune the models. Data processing is done", ""]},
{"link": "https://www.br.freelancer.com/projects/machine-learning/large-language-model-for-software", "title": "A Large Language Model for Software Installation & Error Resolution", "status": "Aberto", "price": "₹1500-12500 INR", "paid_when": "Pago na entrega", "posted_when": "Postado 2 horas atrás", "deadline": "Termina em 6 dias", "description": ["I'm looking for developer capable of developing a large language model for text generation. This project is all about generating creative text with a particular focus on software installation and error fixation.", "", "Key Responsibilities:", "- Create a language model that generate text.", "- Ensure the produced text is only specialized in providing solutions for software installation and resolving errors for softwares .", "", "The main goal is to create a language model that is capable of generating text & provide guidance related to software installation & error fixing. Like for installation it should give you the order how the software will be installed and for error like if we sometimes face some settings related error in software or path related error so it should give solution for that.", ""]},
{"link": "https://www.br.freelancer.com/projects/python/solana-based-pnl-tracking-telegram", "title": "Solana-based PnL Tracking Telegram Bot -- 2", "status": "Aberto", "price": "$30-50 USD / hora", "paid_when": "", "posted_when": "Postado 2 horas atrás", "deadline": "Termina em 6 dias", "description": ["I need a simple tg bot to input a wallet address and calculates the PnL of the last X trades. The result should be shown in a simple table with Coin name, Amount invested, Amount returned, PnL and link to relevant transactions", "", "I will share a example image of the result with the candidates.", ""]},
{"link": "https://www.br.freelancer.com/projects/python/python-based-real-time-gesture", "title": "Python-Based Real-Time Gesture Recognition System", "status": "Aberto", "price": "$30-250 USD", "paid_when": "Pago na entrega", "posted_when": "Postado 1 hora atrás", "deadline": "Termina em 6 dias", "description": ["I need a capable individual or team to develop a Python-based facial and gesture recognition system.", "", "Develop a facial and gesture recognition system capable of detecting and counting the number of fingers a person is holding up in real-time using Python, Tkinter for the user interface, and OpenCV for image [login to view URL] are detected simultaneously, the system should recognize all of them.", "", "Ideal candidate will have:", "* Strong working knowledge of Python, Tkinter and OpenCV", "* Prior experience in developing robust facial and gesture recognition systems", "* An understanding of image processing and security monitoring systems.", "", "Functional Requirements:", "User Interface (Tkinter):", "The system shall feature a graphical user interface (GUI) built using Tkinter to provide user interaction.", "GUI components should include a live video feed displaying the webcam input, along with a display area to show the count of fingers detected.", "Facial Detection:", "Utilize OpenCV's face detection algorithms to identify and localize faces within the webcam feed.", "Upon detecting a face, draw a bounding box around it for visual feedback.", "Gesture Recognition:", "Implement gesture recognition techniques to analyze hand gestures within the region of interest (ROI) around the detected face.", "Use OpenCV to isolate the hand region from the face and background.", "Apply image processing techniques (such as thresholding, contour detection, and convex hull) to identify the hand and fingers.", "Implement a finger counting algorithm to accurately count the number of fingers visible in the hand gesture.", ""]},
{"link": "https://www.br.freelancer.com/projects/java/full-stack-developer-for-web", "title": "Full-Stack Developer for Web Application", "status": "Aberto", "price": "$750-1500 USD", "paid_when": "Pago na entrega", "posted_when": "Postado 10 horas atrás", "deadline": "Termina em 6 dias", "description": ["I'm seeking an experienced Full-stack developer who can assist in building a chatbot that is trained on Saudi Stock Market real time data. My project requires a candidate with a diverse programming language skillset.", "", "**Key Skills Needed:**", "- Proficiency in JavaScript, Python, and Ruby, as well as Java, C#, and PHP.", "- Robust knowledge of front-end and back-end development.", "- Experience in building scalable web applications and integrating it with WhatsApp or telegram", "", "**Project Objective:**", "The main objective of this project is to create a user-friendly chatbot trained on Saudi Stock Market that meets my specific business requirements. I'm anticipating a solution that is highly efficient and adaptable, with a seamless performance across numerous platforms.", "", "**Preferable Experience:**", "Previous Chat GPT related projects would be advantageous and would enable the candidate to understand and anticipate the possible challenges and demands faced during development.", "", "Are you up for this challenging yet rewarding task? Apply now, and let's create something extraordinary together!", ""]},
{"link": "https://www.br.freelancer.com/projects/php/inventory-control-system-development", "title": "Inventory Control System Development", "status": "Aberto", "price": "$30-250 USD", "paid_when": "Pago na entrega", "posted_when": "Postado 1 hora atrás", "deadline": "Termina em 6 dias", "description": ["I want to create an inventory system with multiple branches. each branch has its own inventory. Users update the daily inventory and submit. the system will automatically check if we have reached the minimum quantity and notify the users that the minimum quantity has reached for certain Items.", ""]},
{"link": "https://www.br.freelancer.com/projects/python/bulk-pdf-text-table-extraction", "title": "Bulk PDF Text & Table Extraction", "description": "I'm seeking a qualified Python developer to craft a script for the extraction of text and tables from entire PDF documents. The extracted data should be cleanly stored in a database, suitably structured for easy retrieval and analysis. Key Responsibilities: - Creation of Python script that can fetch content from PDFs in bulk - Extraction of both textual data and tables - Storing of extracted values in a database in an organized manner - Ensuring that the entire content of the PDF, regardless of page or section, is considered in the extraction process Ideal Skills: - Strong proficiency in Python programming - Proven experience in data extraction from PDFs - Understanding of database schemas and how to effectively structure extracted data - Attention to detail, to ensure completeness of data extraction from each PDF"},
{"link": "https://www.br.freelancer.com/projects/python/basic-rdf-graph-database-creation", "title": "Basic RDF Graph Database Creation", "description": "I am looking to build a basic level RDF graph database that will primarily handle numerical data. This means the project will require the establishment of few relationships and entities. Key tasks: - Designing the structure for the RDF graph database - Implementing the basic level graph with less entities and few relationships - Setting up the database to effectively manage and process numerical data Ideal Skills and Experience: - Strong understanding and experience of RDF graph databases - Proficiency in Python for application - Ability to handle numerical data efficiently - Experience in developing basic level graph databases with few relations and less entities Those bidding should have a good work ethic and excellent communication skills, as I value updates and progress reports. I'd also appreciate a flexible attitude to alterations or adjustments which may arise during the project. Please share examples of similar projects undertaken in the past."},
{"link": "https://www.br.freelancer.com/projects/python/python-coding-programmer-blogging-37837939", "title": "Python Coding Programmer & Blogging Specialist Needed 5 -- 2", "status": "Aberto", "price": "$10-30 AUD", "paid_when": "Pago na entrega", "posted_when": "Postado 10 horas atrás", "deadline": "Termina em 6 dias", "description": ["I am looking for experienced Python programming solution writers who can write blog articles on Python programming languages, topics will be provided by us and how-to-write format will be provided by us.", "", "Ideal skills and experience for this job include:", "- Proficiency in Python", "- Good writing skills and the ability to explain complex programming concepts in a clear and concise manner", "- Ability to write engaging and informative blog articles", "- Proficiency in conducting research and presenting data analysis findings", "", "The articles should be well-researched, easy to understand, and provide practical insights and examples.", "", "If you have the required skills and experience in any programming and can deliver well-written blog articles within the specified length, please submit your proposal", "", "The following is desirable:", "", "* You are a member of Github, [login to view URL], [login to view URL] or any other programming platform where you have been posting OR", "*You already have a programming blog OR", "*You have written programming content earlier for anyone and have samples to show.", "", "New freelancers are welcome.", "We are an on-demand website where hundreds of programming-related topics need to be covered every day. We are seeking programmers (Students/Freshers) who can perform writing on programming problems and topics.", "", "We will provide Topics/Keywords to write upon. All programming languages are welcome.", "", "This project for:", "Programmers (students/freshers) Who are willing to learn and contribute to the community and want to build their profile and earn a good review/reputation", "", "This is how you will work & earn:", "You can work anytime, anywhere with full freedom to choose your hours. All you need to do is post your topic & earn 8 AUD for each post", "The rate would be incremented in the future based on quality and commitment towards the task.", "", "Answering format as following is provided to maximize your speed and save time:", "", "“Intro: (Why this Occurs? How to Solve it?<In short)”", "What is “this problem”?", "Why “this problem“ happens?", "Suggestions/Tips/Guidelines to write as follows:", "What were you doing and how did you get this problem (How to Reproduce the Error)", "What code or things you did do to get this error (For example how the error occurs)", "Code snippet", "Screenshot of Error/issue", "Error Message in text", "", "How to resolve “this problem”?", "Solution1:()", "Solution2:()", "", "Payment would be made when you cover the 40 AUD milestone, later greater milestone will be created.", "We may increase the rate depending on your performance in the future.", "And we will provide good reviews also.", "", "Please let me know the programming language you are an expert/interested in", "Please provide any following that will be helpful", "* Your LinkedIn, [login to view URL], [login to view URL], etc profile page", "*Your Blog URL", "*Your sample post was written for anyone", ""]},
{"link": "https://www.br.freelancer.com/projects/php/making-odds-matcher", "title": "making an odds matcher -- 2", "status": "Aberto", "price": "£20-250 GBP", "paid_when": "Pago na entrega", "posted_when": "Postado 9 horas atrás", "deadline": "Termina em 6 dias", "description": ["Project Title: Making an Odds Matcher", "", "I am looking for a freelancer who can develop an odds matcher for sports betting odds.", "", "Preferred Programming Language: I am open to suggestions, so please let me know your expertise and recommendation.", "", "The odds matcher should include a feature for real-time updates, allowing users to receive the latest odds information.", "", "Ideal Skills and Experience:", "- Experience in developing odds matching software or similar projects", "- Proficiency in programming languages such as Python or JavaScript", "- Knowledge of sports betting odds and algorithms", "- Ability to integrate real-time data updates into the system", ""]},
{"link": "https://www.br.freelancer.com/projects/python/email-marketing-promotions-solution-saas", "title": "Email Marketing Promotions Solution Saas", "status": "Aberto", "price": "€250-750 EUR", "paid_when": "Pago na entrega", "posted_when": "Postado 9 horas atrás", "deadline": "Termina em 6 dias", "description": ["Greetings,", "", "I am looking to develop a Software as a Service (SaaS) platform that enables users to create and manage automated email campaigns similar to NuReply or Instantly.io. The platform should provide robust functionality for designing, scheduling, and tracking email campaigns with ease.", "", "Project Details:", "", "Feature Requirements:", "", "User-friendly interface for creating and customizing email templates.", "Ability to schedule email campaigns and set up automated follow-ups.", "Advanced segmentation and targeting options based on user behavior and demographics.", "Real-time analytics and reporting to track campaign performance, including open rates, click-through rates, and conversions.", "Integration with popular email service providers (ESPs) for seamless email delivery.", "Responsive design to ensure compatibility across devices and browsers.", "Technology Stack:", "", "Frontend: HTML/CSS, JavaScript (React/Vue.js)", "Backend: Node.js/Python (with frameworks like Express or Django)", "Database: MongoDB/PostgreSQL", "Additional tools and services as needed for email delivery, analytics, etc.", "Project Timeline:", "", "I aim to launch the initial version of the platform within [Specify your timeline here].", "Ongoing development and iteration based on user feedback and market demand.", "Budget and Payment Terms:", "", "Payment terms can be negotiated based on milestones and deliverables.", "Skills Required:", "", "Frontend Development (HTML/CSS, JavaScript)", "Backend Development (Node.js/Python)", "Database Management (MongoDB/PostgreSQL)", "Experience with SaaS development and email marketing platforms", "Preferred Freelancer Experience: Experienced freelancers with a proven track record in SaaS development and email marketing platforms are preferred. However, I am open to working with talented newcomers who demonstrate the necessary skills and enthusiasm for the project.", "", "Additional Notes:", "", "Please include examples of similar projects you have worked on and any relevant portfolio or case studies.", "I value clear communication, reliability, and a collaborative approach to project execution.", "If you are passionate about building innovative SaaS solutions and have the expertise to bring this project to life, I would love to hear from you. Please submit your proposal with details of your experience, approach to the project, and estimated timeline.", "", "Looking forward to collaborating with you on this exciting venture!", ""]},
{"link": "https://www.br.freelancer.com/projects/python/web-application-development-specialist", "title": "Web Application Development Specialist", "status": "Aberto", "price": "$30-250 USD", "paid_when": "Pago na entrega", "posted_when": "Postado 8 horas atrás", "deadline": "Termina em 6 dias", "description": ["I am looking for a seasoned web application developer. While I haven't specified a language preference, proficiency in Python, Java, or C++ would be a massive advantage. I have a specific programming project in mind and I believe it requires an expert in these languages who can bring a successful outcome to fruition.", "", "What I need from you:", "• Proven experience in web application development. It would be advantageous for you to provide a brief overview of projects that you've previously completed, focusing specifically on those that show your skill in Python, Java, or C++.", "• Comprehensive understanding of modern programming essentials, with an emphasis on web-based applications.", "", "Looking forward to seeing your proposals and discussing further.", ""]},
{"link": "https://www.br.freelancer.com/projects/algorithm/route-algorithm-adjustment-for-vrp", "title": "Route Algorithm Adjustment for VRP/TSP", "description": "As a tech-savvy professional, I'm seeking a qualified freelancer proficient in Python to help implement a specific routing algorithm for my VRP problem. I already have the source code for the routing algorithm as well as the travel time matrices for testing purposes. Your role would be centered around making minor adjustments to this algorithm. The specific updates needed are: - Changing the datasets being read - Managing the setup of the problem. - Running the specific algorithm on the given dataset and generating a routing plan In order to successfully fulfill this task, you're expected to have a comprehensive understanding of Python programming, routing algorithms, and heuristic techniques. Your expertise in optimization parameters and stop conditions management will also be advantageous for this project. Efficient communication and adherence to deadlines is paramount. Looking forward to your bids!"},
{"link": "https://www.br.freelancer.com/projects/python/python-mediapipe-for-facial-hand", "title": "Python Mediapipe for Facial & Hand Gesture Recognition", "status": "Aberto", "price": "$10-30 USD", "paid_when": "Pago na entrega", "posted_when": "Postado 9 horas atrás", "deadline": "Termina em 6 dias", "description": ["I'm seeking an experienced Python developer who is adept at using Mediapipe for facial recognition tasks. The main goal of this project is to create a facial and hand gesture recognition feature.", "", "Key Tasks:", "- a button to teach gestures and record them with name (multiple gestures, annotating hand and face landmarks with annotation in a live webcam)", "- make them as a model and create mediapipe task file", "- test it in live webcam and show what is the name of the gesture matching", ""]},
{"link": "https://www.br.freelancer.com/projects/python/python-developer-write-program-which", "title": "Python Developer to write a program which copies text from an email and pastes it into my computer", "description": "I need a program which when I receive a new email, will scan for a word after a colon, copy this word and paste and enter on another specific portion of my screen instantly. (the coordinates of the screen portion will stay constant). Specific portion is a search bar in one of the program. So that should paste the word in the search bar, and clicks enter. In that time when the email comes in, it should work instantly. And that time, I might be doing other tasks in my computer too. Also I am using outlook for receiving emails. Ping me with a plan if you can do this."},
{"link": "https://www.br.freelancer.com/projects/python/golf-club-analysis-application-needed", "title": "Golf Club Analysis Application Needed", "status": "Aberto", "price": "$30-250 USD", "paid_when": "Pago na entrega", "posted_when": "Postado 8 horas atrás", "deadline": "Termina em 6 dias", "description": ["Hi,", "", "", "", "I please need a golf-related software program developed to accurately determine a rotation point location along the length of a golf club under specific club movement conditions. In a nutshell, the movement takes place before a swing even begins, where a rotation of the club is commonly performed by a golfer that creates a point along the length of the club. In essence it divides the length of the club into two sections. The point location can vary significantly from golfer to golfer and is a crucial measurement that needs to be found.", "", "", "", "At first thought it would seem to be a comparatively easy task because the club movement occurs before a swing even starts. But club movements during the period can be extremely small and subtle for some clubs and/or golfers, so much so that they are barely noticeable unless specifically looking for them. Furthermore, the entire club as a whole is generally moved around during the period, so the rotation point location does too. This makes it more difficult to track and determine the rotation point location needed for a golfer (along the plane that club weight is sensed).", "", "", "", "Nevertheless, with appropriate skills one should be able to form such a program pretty well. Various attempts have been made in the past, the earliest ones using an inertial-type sensor(s). But sensor reading drifting issues toward determining club positions were a major issue. (An entire pre-swing period from start to finish, over which numerous relevant club movements [waggles] are often individually made [and each can vary some] and separated by short inactive periods, can last upwards of 10 seconds or more. However, measuring just a single representative waggle is generally less than a second, and with the most relevant portion of the waggle being even less than that.)", "", "", "", "Another attempt(s) was using video, video frames, and computer vision (only 2D video is fundamentally required). Simple conspicuous tracking markers were placed on the club to be measured, and apparently some type of artificial intelligence was applied. But the contractor(s) could really not even come close to tracking the markers and determining any kind of usable rotation point location. To the best of my recollection, programming languages such as R (visually nice but unusable in other manners), C, and Python have been used at various times.", "", "", "", "Beyond fundamentally needing to find accurate rotation point locations for golfers, a video-type application \"might\" provide additional information that may be more useful for helping users of and further developing the actual application. But I am not really certain of that right now.", "", "", "", "Results have been so poor and inaccurate among efforts to this point that I am still unable to even positively prove whether certain concepts are correct yet. In view of this I am still essentially at a prototyping stage. So I am still in need a very rudimental version of such an application next, one that can be produced in a manner and with hardware/software components ideally most efficient from time and cost standpoints yet hopefully provide some decent results to finally get to analyze.", "", "", "", "My budget will remain quite small for the project unless and until certain elements are proven well first, and then I can take things from there toward commercialization hoped for. Additional details are available regarding documentation of past attempts and the good and bad of those along with more of what is needed for a next attempt. With various IP rights in play, an NDA will likely be required in order for me to release most additional details.", "", "", "", "I am open to considering project or hourly rates, though completely open-ended hourly rates cannot really be considered and a good estimate of hours required should be possible for what is needed here. Please feel free to throw any questions or comments my way, as I could have easily missed one or more things of a very basic nature that might be needed for your consideration. Thanks. I appreciate it.", ""]},
{"link": "https://www.br.freelancer.com/projects/python/python-expert-with-yaafe-knowledge-37838357", "title": "'Python expert with YAAFE Knowledge.", "status": "Aberto", "price": "$30-50 CAD", "paid_when": "Pago na entrega", "posted_when": "Postado 8 horas atrás", "deadline": "Termina em 6 dias", "description": ["I need someone who has knowledge in Python and YAAFE", "if you are pls start your bid with YAAFE", "pls check this and if you can do it I will send you the VMS crederntials", "[login to view URL]", ""]},
{"link": "https://www.br.freelancer.com/projects/python/python-expert-for-fixation", "title": "'Python expert For fixation", "status": "Aberto", "price": "$30-50 CAD", "paid_when": "Pago na entrega", "posted_when": "Postado 8 horas atrás", "deadline": "Termina em 6 dias", "description": ["I need someone who has knowledge in Python and YAAFE", "if you are pls start your bid with YAAFE", "pls check this and if you can do it I will send you the VMS crederntials", "[login to view URL]", ""]},
{"link": "https://www.br.freelancer.com/projects/python/configuration-python-script-for-sports", "title": "Configuration of Python Script for Sports Data Calculation on Website", "status": "Aberto", "price": "€18-36 EUR / hora", "paid_when": "", "posted_when": "Postado 7 horas atrás", "deadline": "Termina em 6 dias", "description": ["I am seeking an experienced freelancer who can assist me in configuring a Python script on my existing website. The script should perform calculations related to sports data and return an output based on the calculations. Specifically, the script will require the functionality to receive input for the home team and away team.", "", "Required Script Functionalities:", "", "Data Calculation: The Python script should be capable of performing calculations related to sports data. These calculations could include but are not limited to match predictions, team statistics analysis, or player performance evaluation.", "", "Input Reception: The script should be able to receive input for the home team and away team from the website users. This input will be used as parameters for the calculations.", "", "Output Generation: Based on the input received and the calculations performed, the script should generate an output to be displayed on the website. This output could be in the form of match predictions, statistical analysis results, or any other relevant information.", "", "Freelancer Requirements:", "", "Proven experience in developing Python scripts for data processing and calculation purposes.", "Ability to integrate the Python script seamlessly into an existing web environment.", "Strong understanding of sports data analysis and relevant algorithms.", "Clear communication skills and a collaborative work approach to ensure project success.", "", "Delivery Time: Fastly", "", "", "", "If you are an experienced freelancer with the necessary skills to configure the Python script for sports data calculation on my website, please submit your proposal. Include details about your past experience and how you plan to approach this project. Thank you!", ""]},
{"link": "https://www.br.freelancer.com/projects/python/football-score-predictive-model-37838453", "title": "Football Score Predictive Model Development -- 2", "status": "Aberto", "price": "$250-750 USD", "paid_when": "Pago na entrega", "posted_when": "Postado 7 horas atrás", "deadline": "Termina em 6 dias", "description": ["I'm seeking a data scientist skilled in neural networks to create a model capable of predicting football match scores and outcomes. The model should be applicable to both domestic and international matches.", "", "Key Requirements:", "- The dataset must include as much historical data as possible. Freelancer has to make or find the dataset so model will be highly accurate.", "- Include pertinent variables like team form, head-to-head records, and injury updates.", "- The model should give results in terms of 1x2 percentages and a scoreline prediction.", "Should also be able to retrieve odds on matches and rank them by most value compared to the neural network prediction.", "", "Should be able to put results up on very simple site and retrieve odds from bookmakers on a click.", "", "Please note: The preferred programming language for this project has not been specified. However, proficiency in Python, R, or MATLAB - popular languages for building and deploying neural network models - would be advantageous. Proven experience in predictive modelling, particularly in sports results, is also highly desirable.", ""]},
{"link": "https://www.br.freelancer.com/projects/python/python-expert-now-37838491", "title": ".Python Expert now", "status": "Aberto", "price": "$10-30 CAD", "paid_when": "Pago na entrega", "posted_when": "Postado 7 horas atrás", "deadline": "Termina em 6 dias", "description": ["need python expert to start wroking now", "to implement the code on the website", "if you can start start your bid with PY", ""]},
{"link": "https://www.br.freelancer.com/projects/restful/jasmin-smpp-customization-configuratio", "title": "Jasmin SMPP customization/ configuratio", "status": "Aberto", "price": "$30-250 USD", "paid_when": "Pago na entrega", "posted_when": "Postado 7 horas atrás", "deadline": "Termina em 6 dias", "description": ["We have a Jasmin SMPP setup and a couple of active SMPP connections as well. HTTP + Rest APIs are working in the default configurations.", "", "We need to be able to send the DLT requirements via HTTP/ RestAPI to Jasmin that needs to be send to upstream", "PE_ID + Template_ID", "", "- We are also open to sending the SMS directly to RabbitMQ (bypassing HTTP and Rest APIs) if Jasmin can support the DLT parameters as a consumer side on RabbitMQ.", "", "", "Anyone who has worked with DLT SMS (India specific) as well as Jasmin is preferred. Please do mention your similar experience to be considered for this job.", ""]},
{"link": "https://www.br.freelancer.com/projects/python/write-blog-post-about-our", "title": "Write a blog post about our python command line tool", "status": "Aberto", "price": "€30-250 EUR", "paid_when": "Pago na entrega", "posted_when": "Postado 7 horas atrás", "deadline": "Termina em 6 dias", "description": ["As an avid reader of technical blogs, I'm looking for a skilled writer to construct an informative and comprehensible step-by-step tutorial on how to use our Python-based command line tool. This blog post should doubly serve as a practical user guide.", "", "Here's what I envision you covering in the blog post:", "", "• The initial setup and installation of the tool - Give precise instructions on how to get the tool up and running, ensuring that even beginners can follow.", "", "• Common uses and functionalities - Unravel the multiple ways to use our tool. I am particularly interested in the following features:", "", "- User authentication and authorization: Break down how to securely authenticate and authorize users via our tool.", "", "- File manipulation and processing: Explain the functions relating to file handling and how users can leverage them.", "", "- API integration and data retrieval: Shed light on how our tool interacts with APIs and fetches data.", "", "Your tutorial should be detailed but comprehensible, catering to both tech-savvy readers and those who are new to such tools. Ideally, I am looking for a freelancer with solid command of English, excellent writing skills, and a respectable understanding of Python and CLI tools. Proven experience in technical writing, programming and software documentation is a major plus.", "", "Included should be screenshots of the process. The tool can be found here: [login to view URL]", ""]},
{"link": "https://www.br.freelancer.com/projects/elasticsearch/kibana-expert-for-system-performance", "title": "Kibana Expert for System Performance Dashboard", "description": "I'm actively seeking a skilled Kibana expert to create an effective dashboard that showcases crucial system performance metrics. The main tasks to be performed include: - JSON logs parsing - Dashboard creation. - Visualization of key system performance data. Your dashboard should specifically focus on the following metrics: - CPU usage - Memory usage - Network utilization The ideal candidate should possess an excellent understanding of Kibana and have previous experience in creating insightful data visualization dashboards. Furthermore, they should be adept at presenting complex system performance data in a way that is easy to understand and actionable. Note that your work will play a critical role in helping us monitor and optimize our system performance. So we're looking for someone who can not only meet, but exceed our expectations in this role."},
{"link": "https://www.br.freelancer.com/projects/python/bulk-dynamic-code-website", "title": "Bulk Dynamic QR Code Website", "status": "Aberto", "price": "$30-250 USD", "paid_when": "Pago na entrega", "posted_when": "Postado 7 horas atrás", "deadline": "Termina em 6 dias", "description": ["I need a website that hosts a dynamic QR code generator that can create codes in bulk. The system needs to deliver QR codes capable of directing customers to a website or storing contact information and should be trackable for inventory purpose.", "", "The ideal platform for implementing this solution is a web-based one, hence making it accessible across multiple devices without the need to download an application.", "", "The website needs to facilitate:", "- Batch downloading of generated QR codes", "- Analytics for QR code tracking", "", "The freelancer should have web development experience, specifically in creating similar QR code systems, and a clear understanding of QR code analytics. A proficiency in web-based programming languages, specifically Python or JavaScript, is preferred. A background in user interface design would also be beneficial to make the tool user-friendly.", "", "Deadlines are crucial for this project, so a developer that can work efficiently and meet the outlined schedule is required.", ""]},
{"link": "https://www.br.freelancer.com/projects/accounting/odoo-consultant-for-accounting", "title": "Odoo Consultant for Accounting Configuration", "description": "I'm in need of an experienced Odoo consultant who specializes in the Accounting and Finance module. Your primary role would involve issuing me with instructions to allow us to configure and troubleshoot trouble areas in our current implementation (Odoo 17 Entreprise, Online) . There are 4 areas of concern: -Multiple currency not functioning despite activation, no option provided when creating Bank/Cash journals (see attachment) -Accounting Dashboard charts not showing graphs for Bank and Cash accounts movement (full disclosure : we bypassed reconciliation by putting same account in all outstanding journals, refer to attachment for an exemple) -The executive summary report now displays an error message: Invalid Operation (see attachment) -Suggest ways to view the Cash Statement in a graph format. There seems no such option available (see snapshot). Providing clear and adequate INSTRUCTIONS to solve the above issues is the TASK. While your expertise in other Odoo areas is appreciated, our primary focus is: - Comprehensive finance-related system configuration - Rigorous troubleshooting for smooth operations This role is suitable for candidates who are: - Well-versed in the intricacies of the Odoo platform, particularly in the Accounting and Finance module. - Experienced in system configuration and troubleshooting. - Able to proactively identify potential issues and devise effective solutions."},
{"link": "https://www.br.freelancer.com/projects/python/python-expert-help-fix-the-37838819", "title": "Python expert to help fix the script...", "status": "Aberto", "price": "$10-30 CAD", "paid_when": "Pago na entrega", "posted_when": "Postado 6 horas atrás", "deadline": "Termina em 6 dias", "description": ["I need someone who has knowledge in Python to help fixing the script and make it working well", "start your bid with NOW if you can start immediately", ""]},
{"link": "https://www.br.freelancer.com/projects/python/customized-connection-controller-for", "title": "Customized Connection Controller for PC Apps", "status": "Aberto", "price": "₹1500-12500 INR", "paid_when": "Pago na entrega", "posted_when": "Postado 11 horas atrás", "deadline": "Termina em 6 dias", "description": ["I'm looking for a seasoned programmer who can develop a program that will channel specific PC applications to either a WiFi or Ethernet connection, based on requirements. This targeting will be applied to three types of applications, developed using different coding languages: Python, Java, and C#.", "", "Key Requirements:", "", "- Development of a program that can efficiently set WiFi or Ethernet connection for specific applications on a Windows system.", "- The program should be able to target applications written in Python, Java, and C#.", "- The system must be user-friendly and offer simple ways to switch between WiFi and Ethernet connections for each individual application.", "- Conduct testing to ensure the program operates effectively under different scenarios.", "- Address any bugs or errors encountered during the development process.", "", "Ideal Skills and Experience:", "", "- Proficiency in Python, Java, and C#.", "- Prior experience in programming applications for Windows.", "- Understanding of WiFi and Ethernet connection setups.", "- Excellent debugging skills.", "- Ability to deliver a user-friendly system interface.", "", "The final product should provide seamless switching between WiFi and Ethernet, enhancing functionality based on defined application needs. If you possess the ability to create this system and have a proven track record, I look forward to receiving your bid.", ""]},
{"link": "https://www.br.freelancer.com/projects/ruby-on-rails/multi-lingual-notification-system", "title": "Notification System Development", "status": "Aberto", "price": "₹1500-12500 INR", "paid_when": "Pago na entrega", "posted_when": "Postado 4 horas atrás", "deadline": "Termina em 6 dias", "description": ["We are seeking a skilled and experienced freelance Software Engineer to develop a robust Notification Engine or module from scratch. The ideal candidate should have expertise in building scalable and efficient notification systems that can seamlessly integrate with existing applications. The primary focus will be on creating a modular and flexible codebase that can be easily plugged into existing mobile app or various applications.", "", "\"Final project/code handover in the form of a mobile app with FE and BE Sourcecode, subject to testing before final approval.\"", "", "Responsibilities:", "", "# Develop a Notification Engine or module from scratch that aligns with project requirements.", "# Design and implement scalable and efficient notification systems.", "# Ensure seamless integration of the notification code with existing applications.", "# Collaborate with the existing development team to understand system architecture and requirements.", "# Optimize code for performance, maintainability, and scalability.", "# Troubleshoot, debug, and resolve any issues related to the notification system.", "# Stay updated on industry best practices and technologies related to notification services.", "", "Requirements:", "", "- Proven experience in building notification engines or modules.", "- Proficiency in one or more programming languages such as Python, Ruby, Go, or Node.js.", "- Strong understanding of system architecture and integration with existing applications.", "- Familiarity with various notification mechanisms (push, email, SMS, etc.).", "- Experience in optimizing code for performance and scalability.", "", "- Efficient management and delivery of daily notifications", "- Flexibility across multiple platforms (Email, Apps, Web)", "- Seamless notification experience for users", "- Excellent command of aforementioned programming languages", "", "Interested candidates are invited to submit their resume, portfolio (if applicable), and a brief cover letter outlining their relevant experience. Previous experience in a similar project will be advantageous.", ""]},
{"link": "https://www.br.freelancer.com/projects/java/versatile-restful-api-development", "title": "Versatile RESTful API Development", "status": "Aberto", "price": "€20000-50000 EUR", "paid_when": "Pago na entrega", "posted_when": "Postado 4 horas atrás", "deadline": "Termina em 6 dias", "description": ["I am in need of a talented developer who can design and build a RESTful API with a focus on several specific functionalities. As the ideal candidate, you are skilled in multiple programming languages (Python, Java, JavaScript) and databases (MySQL, PostgreSQL, MongoDB), in order to deliver the best fitting solution to our needs.", "", "The central features that the API should possess include:", "", "- User authentication: An integral feature to ensure only verified users gain access", "- Data encryption: To secure the data and safeguard privacy", "- File upload/download: This functionality will aid in seamless data transition", "", "The idea of the job is to create an interface with our internal système to the format data in a simple an easy to understand format for the web. To do so we expect to create a RESTfull API.", ""]},
{"link": "https://www.br.freelancer.com/projects/php/password-guessing-tool-for-social", "title": "Password Guessing Tool for Social Media", "status": "Aberto", "price": "$250-750 USD", "paid_when": "Pago na entrega", "posted_when": "Postado 4 horas atrás", "deadline": "Termina em 6 dias", "description": ["I'm in need of a proficient developer to create a password guessing tool for three major social media platforms: Facebook, Instagram, and Twitter. And snapchat", "", "Important Tool Features:", "- The tool should have multi-account support", "", "Ideal Candidate:", "- Experience in coding and software development is pivotal", "- You must have a history of creating similar tools or systems", "- In your bid, please share examples of relevant past work.", "", "Please note this project is demanding, but I am confident that with the right expertise, it would be feasible. I highly recommend bidders to read this brief thoroughly and only commit if they are able to develop this tool.", "", "Remember, this tool is for ethical hacking and testing purposes only. Thank you.", ""]},
{"link": "https://www.br.freelancer.com/projects/python/raspberry-face-tracking-system", "title": "Raspberry Pi Face-Tracking System", "status": "Aberto", "price": "₹600-1500 INR", "paid_when": "Pago na entrega", "posted_when": "Postado 4 horas atrás", "deadline": "Termina em 6 dias", "description": ["I am in need of a Python programmer to enable face tracking using a Raspberry Pi 4 and a webcam. The system should leverage a pan-tilt mechanism I possess to physically adjust the webcam's position based on the location of the subject's face in the video feed.", "", "The ideal candidate should have:", "- Expertise in Python programming", "- Experience with Raspberry Pi 4 and related hardware", "- Understanding of pan-tilt face tracking systems", "- Experience with image processing or computer vision, particularly face recognition", "", "Further Specifics:", "- The pan-tilt mechanism that must be utilized is the Pan-Tilt HAT for Raspberry Pi.", "- The camera being used for this project is a webcam.", "- Please note, the goal is to achieve sturdy and smooth face tracking.", "", "I am looking forward to working with a developer who can fulfill these requirements and deliver the solution in a timely manner. Thank you for considering this project.", ""]},
{"link": "https://www.br.freelancer.com/projects/excel/python-code-replacement-for-macro", "title": "Python Code Replacement for Macro", "status": "Aberto", "price": "₹1500-12500 INR", "paid_when": "Pago na entrega", "posted_when": "Postado 3 horas atrás", "deadline": "Termina em 6 dias", "description": ["As someone who values efficiency and automation, I need a proficient Python programmer to replace an existing macro that has been automating a repetitive task in my workflow. The task needs to be executed multiple times a day, hence the need for a dependable script.", "", "Here's a deep dive into what I need:", "- Convert an existing macro to a Python script.", "- The Python script should perform the same functionality as the macro, which is to automate a repetitive task.", "- The Python script will be expected to run on a Windows platform.", "", "Ideal Skills and Experiences:", "- You should have experience with both macros and Python script development.", "- You should have a strong understanding of repetitive task automation, and ideally have some experience in converting macros to Python.", "- You should know how to test scripts on Windows platforms.", "", "Please, do ensure to share relevant experiences or similar automated tasks you've worked on. Looking forward to collaborating and enhancing my task efficiency with your help!", ""]},
{"link": "https://www.br.freelancer.com/projects/3d-modelling/blender-automation-scripting-for-obj", "title": "Blender Automation Scripting for OBJ Mesh Creation", "status": "Aberto", "price": "€6-12 EUR / hora", "paid_when": "", "posted_when": "Postado 4 horas atrás", "deadline": "Termina em 6 dias", "description": ["I require an expert Blender programmer who can upscale my project through scripting and automation. The focus of this job lies specifically in the creation of a custom script. This script will automate the process of creating mesh to conform to specific OBJ files. The ideal candidate would have extensive experience with Blender, particularly with using it to automate object transformations within the 3D modeling process. Skills in scripting in relation to OBJ files would be highly advantageous for this project. Key job aspects include:", "", "- Ability to create custom scripts in Blender.", "- Extensive knowledge of object transformation scripts.", "- Specialist proficiency with OBJ files.", "- Understanding of the 3D modeling process.", ""]},
{"link": "https://www.br.freelancer.com/projects/python/sentiment-analysis-play-store-reviews", "title": "Sentiment Analysis of Play Store Reviews", "status": "Aberto", "price": "₹600-1500 INR", "paid_when": "Pago na entrega", "posted_when": "Postado 3 horas atrás", "deadline": "Termina em 6 dias", "description": ["I'm in need of a professional with strong Python skills to develop a project focused on performing sentiment analysis on Google Play Store reviews. The main goal of this project is to extract features from these reviews and perform an in-depth analysis of their opinions.", "", "Key tasks include:", "", "- Extraction of salient features from Google Play Store reviews, with a particular focus on the review text itself. The aim here is to uncover any meaningful patterns or trends in the reviewers' opinions by precisely examining the text of the reviews.", "", "- Applying a mixed-method approach to sentiment analysis. This robust method of analysis should utilize both supervised and unsupervised learning techniques to successfully classify the sentiment behind each review as either positive, negative, or neutral.", "", "Ideal candidates for this job will have a strong background in Python programming and experience in sentiment analysis, particularly by using mixed-method approaches. It's also important that you have knowledge in text analysis and are adept at uncovering relevant patterns in large datasets. If you've worked with Google Play Store's API or similar platforms in the past, that would be a big plus. But most importantly, I need someone who can think critically about data and take an analytical approach to problem-solving.", ""]},
{"link": "https://www.br.freelancer.com/projects/python/developer-specializing-vision", "title": "AI Developer Specializing in ML & Vision", "status": "Aberto", "price": "$8-15 USD / hora", "paid_when": "", "posted_when": "Postado 1 hora atrás", "deadline": "Termina em 6 dias", "description": ["I want to create a filter so that a line is blurred, I attach a photo of the line, it is a saturation problem but I want to create an algorithm that makes that line disappear.", ""]},
{"link": "https://www.br.freelancer.com/projects/large-language-models/redis-integration-modification-llm", "title": "Redis Integration Modification in LLM (delete docker to use redis-stack inside project)", "status": "Aberto", "price": "€12-18 EUR / hora", "paid_when": "", "posted_when": "Postado 3 horas atrás", "deadline": "Termina em 6 dias", "description": ["Hello there !", "", "My project is about modifying an existing LLM to alter its database integration. Particularly, it involves a shift towards a local Redis stack, eliminating the need for Docker which is currently in use. You can find the LLM here : [login to view URL]", "", "Key Tasks:", "", "- Understand the existing LLM and its database integration.", "- Develop a method to shift the Redis database from Docker to a local Redis-stack", "- Indeed, Docker makes it hard for me to deploy the project on a platform such as [login to view URL]", "", "Ideal Candidate:", "", "The ideal candidate must have the following skills:", "", "- A comprehensive understanding of LLM.", "- In-depth experience with Redis database.", "- Proven expertise in database migration.", "- Hands-on experience in eliminating Docker dependencies.", "- Should be able to install the redis stack and adapt the code to avoid using Docker.", "", "Timeframe:", "", "While I have no hard deadline for the completion of this project, consistent progress and timely results are appreciated. I look forward for your proposals soon!", ""]},
{"link": "https://www.br.freelancer.com/projects/python/python-developer-needed-37839802", "title": "Python developer needed..", "status": "Aberto", "price": "$30-250 AUD", "paid_when": "Pago na entrega", "posted_when": "Postado 1 hora atrás", "deadline": "Termina em 6 dias", "description": ["Python Devoloper Needed", "- I want to fix features", ""]},
{"link": "https://www.br.freelancer.com/projects/software-architecture/create-software-related-language-model", "title": "Create Software related Language Model", "status": "Aberto", "price": "₹600-1500 INR", "paid_when": "Pago na entrega", "posted_when": "Postado 31 minutos atrás", "deadline": "Termina em 6 dias", "description": ["I am looking for AI developer to create a large language model (LLM) specifically for installation and error fixing of softwares.", "", "Project Goal:", "", "create an LLM that can generate creative text specifically for software installation and troubleshooting software related errors.", "", "This includes:", "Installation Guidance: The model should provide general instructions for installing various software programs.", "Error Resolution: The model should give solutions to common software errors, including configuration issues and path-related problems.", "", "", "Note: This project(minor project) is intended for personal use only and will not be utilized for professional purposes", ""]},
{"link": "https://www.br.freelancer.com/projects/python/flask-developer-for-python-creation", "title": "Flask Developer for Python UI Creation", "description": "I'm seeking a skilled Flask developer to create a highly efficient web-based UI for my Python project. This user interface will be particularly designed to highlight the main project functionality, which is process automation. Once developed, I'd like the environment set up on a cloud-based server. It is integral that you have: - Extensive experience with Flask development - Knowledge of Web-based UI design for Python Projects - Proven python process automation skills - Expertise in cloud-based hosting Your bid should include your plan for creating the UI and how you would host it on the chosen server. Demonstrated experience in similar projects will be advantageous."},
{"link": "https://www.br.freelancer.com/projects/python/python-code-for-google-cloud", "title": "Python Code for Google Cloud Composer", "description": "Hi there, I am looking for an experienced Python developer who is proficient in working with Google Cloud Platform (GCP). The main task is to write Python codes that are capable of creating and deleting a Google Cloud Composer environment. What I expect: - Detailed Python codes which have comments explaining what each line does - Properly tested and documented code - Clean and efficient coding skills Ideal skills needed: - Proficiency in Python programming language - Knowledge and experience with Google Cloud Functions - Familiarity with Google Cloud Composer and its environment settings Please note that you are not required to configure any specific parameters or settings while creating or deleting the Cloud Composer environment for this particular project. Feel free to reach out to me for more clarity on the project requirement. Thank you in advance for your attention and bids."},
{"link": "https://www.br.freelancer.com/projects/web-scraping/script-programme-book-the-appointment", "title": "script or programme to book the appointment automatically -tls contact", "status": "Aberto", "price": "£20-250 GBP", "paid_when": "Pago na entrega", "posted_when": "Postado 2 minutos atrás", "deadline": "Termina em 6 dias", "description": ["I'm looking for a skilled developer who can create a script or programme for me, to book the appointment from tls contact automatically.", "", "Key Features:", "The script or program should be capable of booking appointments without any manual intervention.", "", "Ideal Skills/Experience:", "Web scraping", "Web automation", "Overcoming Ip blocking or ReCaptcha Protected websites", "", "Qualifying freelancers should be able to demonstrate a keen understanding of automation and integration techniques and also provide samples of similar projects they have completed in the past.", ""]},
{"link": "https://www.br.freelancer.com/projects/python/python-coding-programmer-blogging-37838814", "title": "Python Coding Programmer & Blogging Specialist Needed -- 2", "status": "Aberto", "price": "$10-30 AUD", "paid_when": "Pago na entrega", "posted_when": "Postado 6 horas atrás", "deadline": "Termina em 6 dias", "description": ["I am looking for experienced Python programming solution writers who can write blog articles on Python programming languages, topics will be provided by us and how-to-write format will be provided by us.", "", "Ideal skills and experience for this job include:", "- Proficiency in Python", "- Good writing skills and the ability to explain complex programming concepts in a clear and concise manner", "- Ability to write engaging and informative blog articles", "- Proficiency in conducting research and presenting data analysis findings", "", "The articles should be well-researched, easy to understand, and provide practical insights and examples.", "", "If you have the required skills and experience in any programming and can deliver well-written blog articles within the specified length, please submit your proposal", "", "The following is desirable:", "", "* You are a member of Github, [login to view URL], [login to view URL] or any other programming platform where you have been posting OR", "*You already have a programming blog OR", "*You have written programming content earlier for anyone and have samples to show.", "", "New freelancers are welcome.", "We are an on-demand website where hundreds of programming-related topics need to be covered every day. We are seeking programmers (Students/Freshers) who can perform writing on programming problems and topics.", "", "We will provide Topics/Keywords to write upon. All programming languages are welcome.", "", "This project for:", "Programmers (students/freshers) Who are willing to learn and contribute to the community and want to build their profile and earn a good review/reputation", "", "This is how you will work & earn:", "You can work anytime, anywhere with full freedom to choose your hours. All you need to do is post your topic & earn 8 AUD for each post", "The rate would be incremented in the future based on quality and commitment towards the task.", "", "Answering format as following is provided to maximize your speed and save time:", "", "“Intro: (Why this Occurs? How to Solve it?<In short)”", "What is “this problem”?", "Why “this problem“ happens?", "Suggestions/Tips/Guidelines to write as follows:", "What were you doing and how did you get this problem (How to Reproduce the Error)", "What code or things you did do to get this error (For example how the error occurs)", "Code snippet", "Screenshot of Error/issue", "Error Message in text", "", "How to resolve “this problem”?", "Solution1:()", "Solution2:()", "", "Payment would be made when you cover the 40 AUD milestone, later greater milestone will be created.", "We may increase the rate depending on your performance in the future.", "And we will provide good reviews also.", "", "Please let me know the programming language you are an expert/interested in", "Please provide any following that will be helpful", "* Your LinkedIn, [login to view URL], [login to view URL], etc profile page", "*Your Blog URL", "*Your sample post was written for anyone", ""]},
{"link": "https://www.br.freelancer.com/projects/python/python-based-image-classification-system", "title": "Python-Based Image Classification System with robotics", "status": "Aberto", "price": "₹2500-3000 INR", "paid_when": "Pago na entrega", "posted_when": "Postado 6 horas atrás", "deadline": "Termina em 6 dias", "description": ["I am in need of a capable and experienced freelancer to help build a python-based object classification system intended for security monitoring. The system will utilise a camera module like the esp32, connected over wifi.", "", "Key functionality required includes:", "", "- The main object of interest the system will identify and classify is humans. This is non-negotiable.", "- Should have the ability to custom train the model with my own datasets", "", "An ideal freelancer for this project should have robust Python programming skills, have experience with object classification projects, and be adept in working with camera modules such as esp32 over wifi. This project requires a deep understanding of image processing, machine learning, and security system applications.", "", "Skill Required: Python, Robotics, ImageClassification, ESP32 etc.,", ""]},
{"link": "https://www.br.freelancer.com/projects/web-scraping/extrator-contatos-facebook", "title": "Extrator de Contatos de Facebook", "status": "Aberto", "price": "$10-30 USD", "paid_when": "Pago na entrega", "posted_when": "Postado 6 dias atrás", "deadline": "Termina em 3 dias", "description": ["Estou à procura de um freelancer altamente qualificado e experiente, que possa me ajudar a fazer o scraping do Facebook para extrair os contatos dos meus clientes. Os dados necessários são:", "", "• Nome", "• Endereço de e-mail", "• Número de telefone", "", "É crucial considerar o critério específico de localização geográfica durante a extração dos perfis. Quero focar em clientes de uma área geográfica específica, portanto, a capacidade de segmentar por localização é essencial.", "", "Espero receber os dados extraídos em um formato de planilha do Excel. Então, a capacidade de organizar e formatar dados dessa maneira é um requisito obrigatório para este trabalho.", "", "Os candidatos ideais para este projeto já terão experiência comprovada em scrap de redes sociais, particularmente do Facebook, e estarão familiarizados com as técnicas de seleção de informações baseadas na localização geográfica. Você deve ser proficiente em manipulação de dados e uso de planilhas do Excel.", "", "Espero poder contatar um freelancer confiável e começar a trabalhar neste projeto o mais rápido possível. Se estiver interessado, por favor faça sua proposta. Aguardo suas propostas!", ""]}
]